---
layout: post
title: javascript 你不知道的原型继承
category: 技术
tags: Javascript
description: 关于js原型继承原理详解
---

### 来自面向类的语言的误区

Javascript的原型继承通常认为是动态语言版本的类继承。
人们对于“继承”的心理预期并不能掩盖javascript中原型继承和类继承几乎完全相反的行为表现。

类似其他面向类语言的术语，“类”，“构造函数”，“实例”，“多态”等，很多javascript书籍，或是大部分的javascript书籍都会把这些术语概念用javascript的特性来演示一遍。
通常来说，因为面向类语言的在语言发展过程中的绝对优势地位，那一套面向对象的设计模式深入人心并几近成为语言范式。

当这些术语变得无处不在，拓展自身含义甚至潜入js中潜移默化时，在接受类语言优秀的面向对象思维的之余，我们更要认清类继承与原型“继承”的区别。

### 狭义，或是说，真正的继承

继承意味着复制，新建一个副本。


### 原型“继承” 实质

js中的继承并不是新建一个副本，js会在两个对象之间创建一个关联。
关联的目的是让一个对象能访问另一个对象的属性和方法。
这种关联的方式 可以认为是一种 委托机制。




